In [127]:
import pandas as pd
from pandas import Series, DataFrame
import string
import numpy as np

In [2]:
path = 'train.csv'

In [3]:
titanic_train = pd.read_table(path, sep = ",")

In [4]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

####Feature engineering

In [83]:
##titles = titanic_train['Name'].tolist()
titanic_train['Name'].str.extract(',(.*)\.').unique()

array([' Mr', ' Mrs', ' Miss', ' Master', ' Don', ' Rev', ' Dr', ' Mme',
       ' Ms', ' Major', ' Mrs. Martin (Elizabeth L', ' Lady', ' Sir',
       ' Mlle', ' Col', ' Capt', ' the Countess', ' Jonkheer'], dtype=object)

In [148]:
def return_title(x):
    name = x['Name']
    sex = x['Sex']
    if any(title in name for title in ['Don', 'Major', 'Master', 'Rev', 'Jonkheer', 'Col', 'Mr', 'Sir']):
        return 'Mr'
    elif any(title in name for title in ['Countess', 'Mme', 'Mrs']):
        return 'Mrs'
    elif any(title in name for title in ['Mlle', 'Ms', 'Miss', 'Lady']):
        return 'Miss'
    elif any(title in name for title in ['Capt']):
        return 'Captain'
    elif any(title in name for title in ['Dr']):
        if sex == 'Male':
            return 'Mr'
        else:
            return 'Mrs'
    else:
        return name

In [149]:
##map function: map(f, iterable) basically applies the function to every iteration
##apply: Applies function along input asix of DataFrame
titanic_train['Title'] = titanic_train.apply(return_title, axis=1)

In [150]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C,Mr
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S,Mr
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S,Mr

In [151]:
titanic_train['Title'].value_counts()

Mr         700
Miss       181
Mrs          9
Captain      1
dtype: int64